[
  {
    "id": "c67ab8a7",
    "title": "Booki",
    "cover": "/images/Booki/CoverBooki.webp",
    "pictures": ["/images/Booki/Picture1.webp", "/images/Booki/Picture2.webp"],
    "short_description": "Page d'accueil d'une agence de voyage",
    "description": "Ce projet a marqué mes premiers pas dans l'univers du HTML et CSS. La mission consistait à développer une page web conforme à une maquette Figma tout en garantissant sa compatibilité sur mobile, tablette et desktop. Les consignes incluaient la simulation d'un bouton de recherche ainsi que l'ajout d'effets graphiques sur divers éléments pour enrichir l'expérience utilisateur.",
    "tags": ["HTML", "CSS"]
  },
  {
    "id": "b9123946",
    "title": "Sophie Bluel",
    "cover": "/images/SophieBluel/CoverSophieB.webp",
    "pictures": ["/images/SophieBluel/Picture1.webp"],
    "short_description": "Site internet d'une architecte d'intérieur",
    "description": "Dans ce projet, j'ai développé la partie Front-End d'un site pour une architecte d'intérieur. La mission consistait à créer une page dynamique présentant ses travaux, à gérer les interactions utilisateurs et à manipuler le DOM avec JavaScript. J'ai également conçu une page de connexion et une modale pour uploader des médias.",
    "tags": ["JavaScript", "HTML", "CSS", "API"]
  },
  {
    "id": "46d188c5",
    "title": "Nina Carducci",
    "cover": "/images/NinaCarducci/CoverNinaC.webp",
    "pictures": ["/images/NinaCarducci/Picture1.webp"],
    "short_description": "Optimisation du site d'une photographe et de son référencement",
    "description": "Dans ce projet, j'ai endossé le rôle de développeur freelance pour améliorer la performance, l'accessibilité et le référencement du site d'une photographe. Ma mission a débuté par une analyse approfondie à l'aide d'outils comme Lighthouse et Wave afin d'identifier les problèmes de chargement et de référencement. J'ai ensuite formulé et mis en œuvre des recommandations pour optimiser la vitesse du site, la structure du code et le SEO. Le projet s'est conclu par la création d'un rapport détaillé, comparant les performances avant et après les modifications, avec des explications claires sur les améliorations apportées et leurs impacts.",
    "tags": [
      "SEO",
      "Performances",
      "Accessibilité",
      "Lighthouse",
      "wave",
      "Référencement Local"
    ]
  },
  {
    "id": "7af00cd6",
    "title": "Kasa",
    "cover": "/images/Kasa/CoverKasa.webp",
    "pictures": ["/images/Kasa/Picture1.webp", "/images/Kasa/Picture2.webp"],
    "short_description": "Site de location d’appartements entre particuliers",
    "description": "Dans ce projet, j'ai développé le front-end d'une application en utilisant React et React Router pour offrir une expérience utilisateur fluide et réactive. J'ai conçu des composants React modulaires pour présenter les données de manière dynamique et mis en place une navigation efficace entre les pages grâce à React Router. Le projet reposait sur des données simulées issues d'un fichier JSON et s'appuyait sur les maquettes fournies.",
    "tags": ["REACT", "HTML", "SASS", "JavaScript", "Node.js"]
  },
  {
    "id": "0979876d",
    "title": "Mon Vieux Grimoire",
    "cover": "/images/Grimoire/CoverGrimoire.webp",
    "pictures": [
      "/images/Grimoire/Picture1.webp",
      "/images/Grimoire/Picture2.webp",
      "/images/Grimoire/Picture3.webp"
    ],
    "short_description": "Site de notation de livres",
    "description": "Dans ce projet, j'ai conçu le back-end d'un site de notation de livres en utilisant Express et MongoDB. Mon rôle a consisté à structurer le serveur, établir la communication avec la base de données et implémenter des opérations CRUD pour gérer les livres et les notations. J'ai également intégré un système d'authentification sécurisé, géré le téléchargement et l'optimisation des images, et développé des fonctionnalités permettant de noter les livres et de calculer des moyennes. En suivant une architecture MVC et en utilisant Mongoose pour modéliser les données, j'ai respecté les bonnes pratiques du Green Code afin de réduire l'empreinte écologique de l'application.",
    "tags": ["Node.js", "Express", "Mongoose", "MongoDB", "API"]
  },
  {
    "id": "f72a452f",
    "title": "Menu-Maker By Qwenta",
    "cover": "/images/MenuMaker/CoverMenuM.webp",
    "pictures": [
      "/images/MenuMaker/Picture1.webp",
      "/images/MenuMaker/Picture2.webp"
    ],
    "short_description": "Application de gestion et de personnalisation de menus",
    "description": "Dans ce projet, j'ai assumé le rôle de planificateur pour le développement d'un site web. Mes responsabilités incluaient la réalisation d'une veille technologique pour identifier les outils et technologies adaptés, la rédaction des spécifications techniques détaillées, et la décomposition des fonctionnalités en tâches claires et spécifiques. J'ai utilisé un outil de gestion de projet, tel que Notion, pour structurer le travail et créer un tableau Kanban afin d'assurer un suivi efficace du projet. Enfin, j'ai présenté une solution technique détaillée, offrant une vision claire et organisée du développement à venir. ",
    "tags": ["Agile/SCRUM", "NOTION", "feedly"]
  }
]
